/*Да се създаде програма, която създава едномерен масив от 10 реални елемента.Да се направи проверка на въведени от потребителя стойности и да определи кои от тях са четни.
 При откриване на четни стойности да се извърши повдигане на 3та степен. При нечетни стойности, събиране с 10*/

#include <stdio.h>
#include <math.h>
#include <iostream>

int main() {
    double arr[10]; // Дефинираме едномерен масив с 10 елемента

    printf("Vuvedete 10 realni chisla:\n");
    for (int i = 0; i < 10; i++) { // Цикъл който въвеждане елементите в масива
        scanf_s("%lf", &arr[i]); // Четем релано число и го записваме в масива
    }


    for (int i = 0; i < 10; i++) {
        if ((int)arr[i] % 2 == 0) { // Проверка дали стойностите са четни

            arr[i] = pow(arr[i], 3); // Ако са четни стойностите, тука повдигаме на 3та степен
        }
        else {

            arr[i] = arr[i] + 10; // Ако са нечетни стойностите, тука събираме с 10
        }
    }

    printf("Rezultat:\n"); // Извеждане на резултата
    for (int i = 0; i < 10; i++) // Цикъл който извежда елементите от масива
    {
        printf("arr[%d]=%.2lf\n", i, arr[i]); // Извеждаме всеки елемент от масива
    }

    return 0;
}


