/*Да се създаде програма, която създава едномерен масив от 10 реални елемента.Да се направи проверка на въведени от потребителя
стойности и да определи кои от тях са четни. При откриване на четни стойности да се извърши повдигане на 3та степен. 
При нечетни стойности, събиране с 10*/

#include <stdio.h>
#include <iostream>

int main()
{
    double arr[10];
	printf("Vuvedete 10 realni chisla:\n");

	for (int i = 0; i < 10; i++)
	{
		scanf_s("%lf", &arr[i]);
	}
	for (int i = 0; i < 10; i++)
	{
		printf("%lf", arr[i]);
	}
}

