/*Земеделски производител продава реколта от градината на зеленчуковата борса продава зеленчуци за N лева за килограм и плодове за M лева за килограм. Напишете програма която пресмята приходите от реколтата на производителя в долари.*/

#include <iostream>
#include <math.h>
#include <stdio.h>
#include <fstream>
#define ЛЕВА_В_ДОЛАРИ 1.67

int main()
{
	double зеленчуци;
	scanf_s("%lf", &зеленчуци);
	double плодове;
	scanf_s("%lf", &плодове);
	printf("%.2lf", (зеленчуци + плодове) / ЛЕВА_В_ДОЛАРИ);
}


