/*Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и котки. Храната се пазарува от зоомагазин, като една опаковка храна за кучета е на цена 2.50 лв, а опаковка хран за котки струва 4 лв*/
#include <iostream>
#include <math.h>
#include <stdio.h>
#include <fstream>


int main()
{
	double кучешка_храна_цена = 2.50;
	int котешка_храна_цена = 4;
	int брой_кучета, брой_котки;
	scanf_s("%d%d", &брой_кучета, &брой_котки);
	printf("%lf", брой_кучета * кучешка_храна_цена + брой_котки * котешка_храна_цена);



}

